[{"word":"Good","def":"A physical product such as a car"},
{"word":"Service","def":"Something you pay someone for but cannot touch - such as a advice or a bus ride"},
{"word":"Customer","def":"Someone who buys a prduct from a business"},
{"word":"Consumer","def":"Someone who uses goods and services provided by businesses"},{"word":"Entrepreneur","def":"Someone willing to take risks to develop a business idea"},{"word":"Entrepreneurship","def":"The ability to take risks to develop a business idea"},{"word":"Social Enterprise","def":"A business that is set up to help society rather than make a profit"},{"word":"Resources","def":"These are the inputs that a business uses to provide their goods and services"},{"word":"Enterprise","def":"Another word for business. It also refers to the skills of people who can spot business opportunities"},{"word":"Interest","def":"The money paid by banks as a reward to attact people to save with them"},{"word":"Innovative","def":"A characteristic of someone who is good at spotting an opportunity"},{"word":"Risk Takers","def":"Someone who is willing to take risks that could result in failure to achieve their goal"},{"word":"Organised","def":"The characteristic that makes you good at managing things"},{"word":"Determined","def":"A characteristic that you need so you don't give up. Starting a business is hard and exhausting"},{"word":"Primary Sector","def":"Businesses in the first stage of production that use raw materials like farms and mining companies."},{"word":"Secondary Sector","def":"This sector is made up of businesses that turn raw materials into products."},{"word":"Tertiary Sector","def":"This sector is the final stage that provide a service like fast food restuarants and delivery companies."},{"word":"Marketing","def":"The part of a business that deals with advertising and target market"},{"word":"Operations","def":"This part of a business deals with the production of the business' product"},{"word":"Human Resources","def":"The part of a business that manages the employees"},{"word":"Finance","def":"The part of a business that manages the money going into and out of the business"},{"word":"Interest Rates","def":"The cost of borrowing money or the reward for saving money"},{"word":"Inflation","def":"The rate at which prices increase"},{"word":"Gross Domestic Product","def":"This measures all income earned in a country's economy in a year"}]