[{
	"word": "Diversification",
	"def": "When a business starts selling new products in new markets"
}, {
	"word": "Retention",
	"def": "This is the proportion of a workforce who remain with the business over a period of time; usually a year."
}, {
	"word": "Recruitment",
	"def": "The process of finding and appointing new employees."
}, {
	"word": "Selection",
	"def": "This is where a business chooses the right employees from those that have applied for a job."
}, {
	"word": "Internal Recruitment",
	"def": "Where a job vacancy is filled from within the existing workforce."
}, {
	"word": "External Recruitment",
	"def": "Filling a job vacancy from any suitable person not already employeed by the business."
}, {
	"word": "Job Analysis",
	"def": "The collection and interpretation of information about a job."
}, {
	"word": "Job Description",
	"def": "This states information about the duties and tasks that make up a job."
}, {
	"word": "Person Specification",
	"def": "This sets out the qualifications and skills required by an employee to fill a job"
}, {
	"word": "Curriculum Vitae",
	"def": "This document gives information about a person including qualifications - employment history and interests"
}, {
	"word": "Productivity",
	"def": "The quantity of goods or services produced by an employee over a period of time; such as a year."
}, {
	"word": "Quality",
	"def": "The extent to which customers requirements are met."
}, {
	"word": "Customer Service",
	"def": "The part of a business that is concerned with meeting customer needs as fully as possible."
}, {
	"word": "Contract of Employment",
	"def": "A legal document stating the hours of work - rates of pay - duties and other conditions under which a person is employed."
}, {
	"word": "Full-time Employment",
	"def": "When employee works a number of hours equal to the normal working week. Usually somewhere between 35 and 40 hours."
}, {
	"word": "Part-time Employment",
	"def": "When an employee works for fewer than the normal number of working hours per week."
}, {
	"word": "Job Share",
	"def": "When two or more employees agree to share the responsibilities of a single job."
}, {
	"word": "Zero Hours Contract",
	"def": "Allows employers to hire staff without any guaranteed hours of work."
}]