[{
	"word": "Cash Flow",
	"def": "The money that flows into and out of a business on a day-to-day basis"
}, {
	"word": "Cash Flow Forecast",
	"def": "A plan of the expected inflows and outflows to and from a business over a period of time"
}, {
	"word": "Cash Flow Statement",
	"def": "A record of the cash inflows and outflows tat took place over an earlier period of time"
}, {
	"word": "Profit",
	"def": "Measures the difference between the values of a business revenue and its total costs"
}, {
	"word": "Revenue",
	"def": "The income that a firm receives from selling its goods or servicces. It is also referred to as turnover."
}, {
	"word": "Sales",
	"def": "The number of products sold by a business"
}, {
	"word": "Costs",
	"def": "The spending that is necessary to set up and run a business"
}, {
	"word": "Fixed Costs",
	"def": "Costs that do not hange when a business changes its output"
}, {
	"word": "Variable Costs",
	"def": "Costs that vary directly with the business level of output"
}, {
	"word": "Total Cost",
	"def": "This is the total of fixed costs plus variable costs"
}, {
	"word": "Profit",
	"def": "Measures the difference between the values of a business revenue and its total costs"
}, {
	"word": "Loss",
	"def": "The amount by which a business costs are larger than its revenue"
}, {
	"word": "Investment",
	"def": "This takes place when a business buys an asset. EG A factory or training for staff."
}, {
	"word": "Average Rate of Return",
	"def": "This compares the average yearly profit from an investment with the cost of the investment and is stated as a percentage"
}, {
	"word": "Break Even",
	"def": "The level of production at which a businesses total costs and revenue from sales are equal"
}, {
	"word": "Break Even Chart",
	"def": "This shows a business cost and revenues and the level of product needed to break even."
}, {
	"word": "Margin of Safety",
	"def": "Measures the amount by which the current level of production exceeds its break-even level of output."
}]