[{"word":"Good","def":"A physical product such as a car"},
{"word":"Service","def":"Something you pay someone for but cannot touch - such as a advice or a bus ride"},
{"word":"Customer","def":"Someone who buys a prduct from a business"},
{"word":"Consumer","def":"Someone who uses goods and services provided by businesses"},{"word":"Entrepreneur","def":"Someone willing to take risks to develop a business idea"},{"word":"Entrepreneurship","def":"The ability to take risks to develop a business idea"},{"word":"Social Enterprise","def":"A business that is set up to help society rather than make a profit"},{"word":"Resources","def":"These are the inputs that a business uses to provide their goods and services"},{"word":"Enterprise","def":"Another word for business. It also refers to the skills of people who can spot business opportunities"},{"word":"Interest","def":"The money paid by banks as a reward to attact people to save with them"},{"word":"Innovative","def":"A characteristic of someone who is good at spotting an opportunity"},{"word":"Risk Takers","def":"Someone who is willing to take risks that could result in failure to achieve their goal"},{"word":"Organised","def":"The characteristic that makes you good at managing things"},{"word":"Determined","def":"A characteristic that you need so you don't give up. Starting a business is hard and exhausting"},{"word":"Primary Sector","def":"Businesses in the first stage of production that use raw materials like farms and mining companies."},{"word":"Secondary Sector","def":"This sector is made up of businesses that turn raw materials into products."},{"word":"Tertiary Sector","def":"This sector is the final stage that provide a service like fast food restuarants and delivery companies."},{"word":"Marketing","def":"The part of a business that deals with advertising and target market"},{"word":"Operations","def":"This part of a business deals with the production of the business' product"},{"word":"Human Resources","def":"The part of a business that manages the employees"},{"word":"Finance","def":"The part of a business that manages the money going into and out of the business"},{"word":"Interest Rates","def":"The cost of borrowing money or the reward for saving money"},{"word":"Inflation","def":"The rate at which prices increase"},{"word":"Gross Domestic Product","def":"This measures all income earned in a country's economy in a year"},{
	"word": "Sole Trader",
	"def": "Someone who sets up a business on their own"
}, {
	"word": "Profit",
	"def": "The difference between the revenue and total costs of a business"
}, {
	"word": "Unlimited liability",
	"def": "When all the personal possessions of the owners are at risk - there is no limit to the amount of money they may need to pay out"
}, {
	"word": "Partnership",
	"def": "When two or more people join together in a business enterprise"
}, {
	"word": "Deed of Partnership",
	"def": "An agreement between partners that sets out the rules of a partnership. Including how profits will be divided and how the business will be valued if a partner decides to leave."
}, {
	"word": "Stakeholders",
	"def": "Individuals and organisations that are affected by"
}, {
	"word": "and effect the activities of a business",
	"def": "Company"
}, {
	"word": "The name given to a business that has its own legal identity. It can own items",
	"def": "owe money and be sued."
}, {
	"word": "Shareholder",
	"def": "This is a person or an organisation that owns part of a company. Each shareholder owns a share of the business."
}, {
	"word": "Limited Liability",
	"def": "When only the business' possessions are at risk"
}, {
	"word": "Stock Exchange",
	"def": "This is where shares of Public Limited Companies are bought and sold."
}, {
	"word": "Flotation",
	"def": "This is when a Private Limited Company becomes a Public Limited Company and has its shares listed on the Stock Exchange"
}, {
	"word": "Not for Profit Organisation",
	"def": "A business where their focus is to achieve objectives other than profit - for example charities"
},{
	"word": "Aim",
	"def": "A general goal of a business"
}, {
	"word": "Objective",
	"def": "A specific target that is set for a business to achieve"
}, {
	"word": "Survival",
	"def": "An objective when a business just wants to continue trading"
}, {
	"word": "Earning a Profit",
	"def": "An objective when the business would like to make more revenue that its total costs"
}, {
	"word": "Shareholder Value",
	"def": "An objective where the Shareholders would like the value of the business to increase"
}, {
	"word": "Customer Satisfaction",
	"def": "An objective where the business would like to have happier customers or consumers"
}, {
	"word": "Market Share",
	"def": "An objective where they aim to sell a specific share of a markets sales"
}, {
	"word": "Dividends",
	"def": "A financial reward paid for each share owned to shareholders"
}, {
	"word": "Growth",
	"def": "An objective where a business may wish to sell more products or open more shops."
}, {
	"word": "Being Ethical",
	"def": "An objective where they wish to be perceived as ethical. Such as looking after their staff or not supporting animal testing"
}, {
	"word": "Environmental and Sustainability",
	"def": "An objective where a business would like to make sure they limit the damage they cause to the environment. They could limit their energy use or use recyclable materials."
}, {
	"word": "Private Sector Organisation",
	"def": "Businesses owned by individuals"
}, {
	"word": "Public Sector Organisation",
	"def": "Businesses owned by the government"
},{
	"word": "Dividends",
	"def": "A financial reward paid for each share owned to shareholders"
}, {
	"word": "Owner",
	"def": "The person who owns the business"
}, {
	"word": "Employees",
	"def": "People paid by the business to complete work"
}, {
	"word": "Suppliers",
	"def": "Businesses that provide other businesses with goods or services"
}, {
	"word": "Community",
	"def": "People that live in the area near the business"
}, {
	"word": "Negotiation",
	"def": "When two sides discuss what they want and try to reach an agreement"
}, {
	"word": "Direct Action",
	"def": "Where people can take action to show they are unhappy with the business. Customers could do this by stopping buying the products and employees could go on strike"
}, {
	"word": "Refusal to co-operate",
	"def": "Local councils could refuse planning permission to expand a factory or employees could resist any changes if they do not like how the business is behaving"
},{
	"word": "Cost",
	"def": "A factor helping decide the location of a business that considers the prices they'll have to pay. A shop in London will be expensive to run."
}, {
	"word": "Sales",
	"def": "A factor of location that considers how likely the business is to have customers. A hotel in a desert is unlikely to have customers"
}, {
	"word": "Image",
	"def": "A factor that deals with the perception of the business. For example a wine from Italy sounds better than one from Derby"
}, {
	"word": "Tariff",
	"def": "A tax on foreign goods imported into the country"
}, {
	"word": "Protectionist Measures",
	"def": "Policies that governments use to protect their own national businesses against competition"
}, {
	"word": "Imports",
	"def": "Goods and services purchased from overseas by consumers of businesses"
}, {
	"word": "Quota",
	"def": "A limit on the amount of foreign goods imported into the a country"
}, {
	"word": "Regulations",
	"def": "The rules businesses have to follow"
}, {
	"word": "Proximity",
	"def": "How close something is"
}, {
	"word": "Raw Materials",
	"def": "The basic materials a business needs to create its products"
}, {
	"word": "Competitors",
	"def": "Other businesses that compete in the same market"
},{
	"word": "Business Plan",
	"def": "A document setting out what a business does and what it hopes to achieve in the future"
}, {
	"word": "Business Planning",
	"def": "The process of producing a business plan"
}, {
	"word": "Uncertainty",
	"def": "When there is a lack of information about a situation. This means the outcome or consequences are very difficult to predict"
}, {
	"word": "Risk",
	"def": "The possibility of something going wrong"
}, {
	"word": "Revenue",
	"def": "The income a firm receives from selling its goods or services. It is also referred to as turnover."
}, {
	"word": "Formula for Revenue",
	"def": "The number of units sold multiplied by the price"
}, {
	"word": "Total costs",
	"def": "The total amount of costs a business needs to pay"
}, {
	"word": "Formula for total costs",
	"def": "Fixed costs plus variable costs"
}, {
	"word": "Fixed costs",
	"def": "Costs that do not change when a business changes its output"
}, {
	"word": "Variable costs",
	"def": "Costs that change directly with the business level of output"
},{
	"word": "Internal Growth",
	"def": "When a business gets bigger by selling more of its products"
}, {
	"word": "External Growth",
	"def": "When a business gets bigger by joining or buying other businesses"
}, {
	"word": "Market Capitalisation",
	"def": "When you measure the value of a company by using its shares. Price of Shares x Number of Shares"
}, {
	"word": "Franchise",
	"def": "When a franchisor sells the rights to its products to a franchisee. Usually in return for a fee or percentage of revenue."
}, {
	"word": "Franchisee",
	"def": "Someone who has bought the rights to a franchise"
}, {
	"word": "Franchisor",
	"def": "Someone who has a franchise to sell. Usually in return for a fee or percentage of revenue."
}, {
	"word": "E-commerce",
	"def": "The act of buying or selling a product using an electronic system like the internet"
}, {
	"word": "Outsourcing",
	"def": "When a business uses another business to produce for it"
}, {
	"word": "Merger",
	"def": "When two or more businesses join together to form a new business"
}, {
	"word": "Takeover",
	"def": "When one business buys control from another one"
}, {
	"word": "Economies of scale",
	"def": "When a business unit costs of production fall as its output rises and the business expands"
}, {
	"word": "Diseconomies of scale",
	"def": "When the cost per unit increase as a business expands"
}]