[{
	"word": "ICT",
	"def": "Computing systems a business might use to exchange information with stakeholders"
}, {
	"word": "Stakeholders",
	"def": "Individuals and organisations that are affected by and affect the activites of a business"
}, {
	"word": "Intranets",
	"def": "Communication networks which can only be accessed by an organisations employees"
}, {
	"word": "Extranets",
	"def": "Communication networks that can be accessed by other organisations such as suppliers"
}, {
	"word": "Software robots",
	"def": "Computer programs that can operate a range of administrative activities instead of employees"
}, {
	"word": "Cloud computing",
	"def": "A general term used for the delivery of specialist computing services such as data storage via the internet"
}, {
	"word": "E-commerce",
	"def": "The act of buying or selling a product using an electronic system like the internet"
}, {
	"word": "M-commerce",
	"def": "Buying and selling products through wireless handheld devices like smartphones"
}, {
	"word": "Digital Communication",
	"def": "The transmission of information electronically between computing devices"
}, {
	"word": "Webchat",
	"def": "Realtime communication using a web browser"
}, {
	"word": "Apps",
	"def": "Software designed for a specific purpose and for use on smartphones and tablets"
}, {
	"word": "Social Media",
	"def": "Online methods of communication such as websites and applications. They share information and help develop contacts"
}, {
	"word": "Shareholder",
	"def": "A person or organisation that owns part of a company. Each shareholder owns a share of the business"
},{
	"word": "Ethics",
	"def": "Whether a business decision is thought to be morally right or wrong. An ethical decision is made on the basis of what is judged to be morally right."
}, {
	"word": "Profit",
	"def": "Measures the difference between the values of a business revenue and its total costs"
}, {
	"word": "Fair Trade Products",
	"def": "Customers are charged higher prices but the company offers better trading terms with its suppliers."
}, {
	"word": "Social Responsibility",
	"def": "An approach to managing businesses in which the interest of all groups in society are taken into account when making decisions"
}, {
	"word": "The Environment",
	"def": "The natural world in which we live."
}, {
	"word": "External costs",
	"def": "Costs caused by businesses on other people - businesses damaging the environment"
}, {
	"word": "Non-Renewable Resources",
	"def": "Resources where there is a limited amount and it will eventually run out"
}, {
	"word": "Global Warming",
	"def": "The gradual heating of Earths surface"
}, {
	"word": "Pressure Group",
	"def": "A group of people with a common interest who influence publc opinion and decisions by businesses and governments"
}, {
	"word": "Environmental responsibility",
	"def": "When individuals or groups act with the intention of protecting the environment"
}, {
	"word": "Sustainability",
	"def": "Methods of production which can be continued in the long term without damage to the envrionment"
}, {
	"word": "Recycling",
	"def": "The reuse of raw materials used in making of products."
}, {
	"word": "Environmental Reporting",
	"def": "The publication of a business environmental performance to the general public"
},{
	"word": "The Economy",
	"def": "Everyone who buys goods and services forms the economy"
}, {
	"word": "Consumers",
	"def": "Individuals who buy gods and services from businesses"
}, {
	"word": "Economic Climate",
	"def": "Describes the state of key factors within a country such as the level of goods and services produced and the number of jobs available"
}, {
	"word": "Interest Rates",
	"def": "The cost of borrowing money or the reward for saving money expressed as a percentage"
}, {
	"word": "Overdraft",
	"def": "A flexible loan which businesses can use up to an agreed limit"
}, {
	"word": "Consumer Spending",
	"def": "The value of goods and services bought by consumers over a time period"
}, {
	"word": "Income Elastic Products",
	"def": "Products whose sales are sensitive to changes in consumers incomes"
},{
	"word": "Globalisation",
	"def": "The trend for markets to expand to become worldwide in scope"
}, {
	"word": "Multinational Company",
	"def": "This type of company produces goods and services in more than one country."
}, {
	"word": "International Trade",
	"def": "Selling goods and services across national borders"
}, {
	"word": "Exports",
	"def": "Goods and services produced by a business in one country and sold in another"
}, {
	"word": "Tariff",
	"def": "A tax on foreign goods imported into a country"
}, {
	"word": "Growth",
	"def": "When a company sells increased quantities of its products"
}, {
	"word": "Economies of scale",
	"def": "When the cost of producing a single unit falls as output increases"
}, {
	"word": "Inward Investment",
	"def": "When governments or businesses or individuals spend money in another country. For example to build a new factory."
}, {
	"word": "Takeover",
	"def": "When a business buys control of another one"
}, {
	"word": "Product Design",
	"def": "When a business translates the needs of consumers into a saleable product"
}, {
	"word": "Quality",
	"def": "How satisfied a consumer is with a product"
}, {
	"word": "Price",
	"def": "The amount a consumer is asked to pay for a single product"
}, {
	"word": "Exchange Rate",
	"def": "The price of one currency expressed in ters of another"
}, {
	"word": "Imports",
	"def": "Goods and services purchased from overseas customers in the domestic market"
}, {
	"word": "Profit",
	"def": "The amount a business revenue from al its sales exceeds its total costs"
},{
	"word": "Legislation",
	"def": "The set of rules that overs the way society operates. Another word for Laws"
}, {
	"word": "National Living Wage",
	"def": "An hourly rate of pay which is set by government. All employees above a certain age must receive at least this pay"
}, {
	"word": "Discrimination",
	"def": "Treating one person differently from another without having good reasons to do so."
}, {
	"word": "Part Time Employee",
	"def": "Working for a proportion of the working week - for example three days rather than all five"
}, {
	"word": "Trade Union",
	"def": "A group of works who act together to improve their pay and working conditions"
}, {
	"word": "Contract of Employment",
	"def": "A legal document state the hours - rates of pay - duties and other conditions under which a person is employed."
}, {
	"word": "Motivation",
	"def": "The range of factors that influence the way a person behaves at work"
}, {
	"word": "Consumer Laws",
	"def": "Laws that have been introduced to prevent businesses from treating their customers unfairly"
}, {
	"word": "Markets",
	"def": "Where there are buyers and sellers"
}, {
	"word": "Competition",
	"def": "When more than one business is attempting to attract the same customers"
}, {
	"word": "Monopoly",
	"def": "When a business does not face any competition in a particular market"
}, {
	"word": "Market Share",
	"def": "The percentage of sales in a particular market recorded by a business"
}, {
	"word": "Uncertainty",
	"def": "When there is a lack of information about a situation. This means the outcome or consequences are very difficult to predict"
}, {
	"word": "Risk",
	"def": "The possibility of something going wrong"
}, {
	"word": "Business plan",
	"def": "A document setting out what a business does and what it hopes to achieve in the future"
}, {
	"word": "Diversification",
	"def": "Occurs when a business start selling new products in new markets"
}, {
	"word": "Recession",
	"def": "When the value of an economys output of goods and services falls for six months or longer."
}, {
	"word": "Entrepreneur",
	"def": "Someone who is willing to take the risks involved in starting a new business"
}]