[{
	"word": "Organisational Structure",
	"def": "The way a business arranges itself to carry out its activities"
}, {
	"word": "Organisational Chart",
	"def": "A plan showing the roles and relationships between all the employees in a business"
}, {
	"word": "Line Manager",
	"def": "An employees immediate superior or boss"
}, {
	"word": "Authority",
	"def": "The power to control others and to make decisions"
}, {
	"word": "Span of Control",
	"def": "The number of employees managed directly by another employee"
}, {
	"word": "Levels or Hierarchy",
	"def": "The layers of authority within a business"
}, {
	"word": "Chain of Command",
	"def": "The line of authority within a business along which communication passes"
}, {
	"word": "Delayering",
	"def": "The removal of one or more levels of hierarchy from a business organisation structure"
}, {
	"word": "Delegation",
	"def": "The passing down of authority to more junior employees"
}, {
	"word": "Communication",
	"def": "The exchange of information between two or more people"
}, {
	"word": "Decentralisation",
	"def": "Where employees working in all areas of the business can take decisions"
}, {
	"word": "Centralisation",
	"def": "Where a small number of senior managers in a business take all the important decisions"
},{
	"word": "Diversification",
	"def": "When a business starts selling new products in new markets"
}, {
	"word": "Retention",
	"def": "This is the proportion of a workforce who remain with the business over a period of time; usually a year."
}, {
	"word": "Recruitment",
	"def": "The process of finding and appointing new employees."
}, {
	"word": "Selection",
	"def": "This is where a business chooses the right employees from those that have applied for a job."
}, {
	"word": "Internal Recruitment",
	"def": "Where a job vacancy is filled from within the existing workforce."
}, {
	"word": "External Recruitment",
	"def": "Filling a job vacancy from any suitable person not already employeed by the business."
}, {
	"word": "Job Analysis",
	"def": "The collection and interpretation of information about a job."
}, {
	"word": "Job Description",
	"def": "This states information about the duties and tasks that make up a job."
}, {
	"word": "Person Specification",
	"def": "This sets out the qualifications and skills required by an employee to fill a job"
}, {
	"word": "Curriculum Vitae",
	"def": "This document gives information about a person including qualifications - employment history and interests"
}, {
	"word": "Productivity",
	"def": "The quantity of goods or services produced by an employee over a period of time; such as a year."
}, {
	"word": "Quality",
	"def": "The extent to which customers requirements are met."
}, {
	"word": "Customer Service",
	"def": "The part of a business that is concerned with meeting customer needs as fully as possible."
}, {
	"word": "Contract of Employment",
	"def": "A legal document stating the hours of work - rates of pay - duties and other conditions under which a person is employed."
}, {
	"word": "Full-time Employment",
	"def": "When employee works a number of hours equal to the normal working week. Usually somewhere between 35 and 40 hours."
}, {
	"word": "Part-time Employment",
	"def": "When an employee works for fewer than the normal number of working hours per week."
}, {
	"word": "Job Share",
	"def": "When two or more employees agree to share the responsibilities of a single job."
}, {
	"word": "Zero Hours Contract",
	"def": "Allows employers to hire staff without any guaranteed hours of work."
}, {
	"word": "Motivation",
	"def": "The range of factors that influence people to behave in certain ways."
}, {
	"word": "Job Enrichment",
	"def": "Designing a job to give interesting and challenging tasks"
}, {
	"word": "Fringe Benefits",
	"def": "The extras that employees may receive in addition to their pay; like a compnay car."
}, {
	"word": "Piecework",
	"def": "A method of payment under which employees are paid according to the quantity of products they produce."
}, {
	"word": "National Living Wage",
	"def": "An hourly rate of pay which is set by the government. All employees above a certain age must receive at least this rate of pay."
}, {
	"word": "Training",
	"def": "A range of activities giving employees job-related skills and knowledge"
}, {
	"word": "Induction Training",
	"def": "The training given to an employee when he or she first starts a job"
}, {
	"word": "On-the-job Training",
	"def": "Training given in the workplace"
}, {
	"word": "Off-the-job Training",
	"def": "Training provided outside of the place of work"
}]