[{
	"word": "Exchange",
	"def": "This occurs when someone gives up something in return for something else. EG A business exchanges a product for money."
}, {
	"word": "Need",
	"def": "Something that needs to be fulfilled for us to survive."
}, {
	"word": "Want",
	"def": "Something we would like to satisfy our needs."
}, {
	"word": "Customer",
	"def": "Someone who buys a product from a business"
}, {
	"word": "Consumer",
	"def": "Someone who uses goods and services produced by businesses"
}, {
	"word": "Sales Volume",
	"def": "Measures the number of items sold"
}, {
	"word": "Sales Value",
	"def": "Measures the revenue generated"
}, {
	"word": "Segmentation",
	"def": "When a market is divided into different groups of needs and wants"
}, {
	"word": "Market Research",
	"def": "The process of gathering and analysing and processing data relevant to marketing decisions."
}, {
	"word": "Market Segment",
	"def": "A group of buyers with similar needs within the overall market"
}, {
	"word": "Primary Market Research",
	"def": "Uses data gathered for the first time"
}, {
	"word": "Secondary Market Research",
	"def": "Uses data that has been gathered already"
}, {
	"word": "Marketing Mix",
	"def": "All the activities influencing whether or not a customer buys a product. The elements of the mix can be analysed using the four Ps."
}, {
	"word": "Price",
	"def": "Where a business must consider the price of a product or service"
}, {
	"word": "Promotion",
	"def": "How and where a business will advertise their products and services"
}, {
	"word": "Place",
	"def": "How and where products and services will be distributed"
}, {
	"word": "Product",
	"def": "All decisions related to the design and specification of the product are considered in this part of the Marketing Mix."
},{
	"word": "Product Portfolio",
	"def": "A collection of products that a firm produces"
}, {
	"word": "Boston Matrix",
	"def": "A way of analysing a products share and growth in their market."
}, {
	"word": "Dog",
	"def": "A product that has a low market share in a low growth market"
}, {
	"word": "Cash Cow",
	"def": "A product that has a high market share in a low growth market"
}, {
	"word": "Question Mark",
	"def": "A product that has a low market share in a fast growth market"
}, {
	"word": "Star",
	"def": "A product that has a high market share in a fast growth market"
}, {
	"word": "Product Life Cycle",
	"def": "Shows how the sales of a product may change over time"
}, {
	"word": "Extension Strategies",
	"def": "Attempts to maintain the sales of a product and prevent it from entering the decline stage of the product life cycle."
}, {
	"word": "Price Skimming",
	"def": "Setting a high price for a product when it first enters the market"
}, {
	"word": "Penetration Pricing",
	"def": "Launching a new product at a low price to achieve fast sales"
}, {
	"word": "Competitive Pricing",
	"def": "Matching the prices that competitors charge"
}, {
	"word": "Loss Leader",
	"def": "A product sold at a loss in the hope that the customer will buy other items from the business where they make a profit"
}, {
	"word": "Cost Plus Pricing",
	"def": "Where products are priced by covering the cost of it to the retailer and adding a percentage on top."
}, {
	"word": "Promotional Activities",
	"def": "The different ways in which a firm tries to communicate with its customers"
}, {
	"word": "Sales Promotions",
	"def": "Short-term incentives to encourage customers to buy"
}, {
	"word": "Advertising",
	"def": "Involves paid for communications"
}, {
	"word": "Promotional Mix",
	"def": "The combination of promotional methods used by a business to communicate with its customers"
}, {
	"word": "Distribution Channel",
	"def": "How the ownership of a product passes from the producer to the final customer."
}, {
	"word": "Wholesalers",
	"def": "These companies buy in large quantities from a producer and sell to retailers."
}, {
	"word": "Retailers",
	"def": "Shops that sell direct to the customer"
}, {
	"word": "E-Commerce",
	"def": "Buying and selling online"
}, {
	"word": "M-Commerce",
	"def": "Online trading via a mobile phone"
}, {
	"word": "Direct Marketing",
	"def": "When there is a direct link from the producer to the customer with no intermediaries"
}, {
	"word": "Intermediary",
	"def": "A link in the distribution chain between the producer and the customer"
}]