[{
	"word": "Entrepreneur",
	"def": "Someone willing to take the risks involved in starting a new business"
}, {
	"word": "Inventories",
	"def": "Raw materials that have not yet been used or products that have been made but not sold. There are also called stocks."
}, {
	"word": "Internal Source of Finance",
	"def": "Money that is available from within the business. EG retained profits."
}, {
	"word": "Owners Funds",
	"def": "Money put into the business by its owners"
}, {
	"word": "Internet",
	"def": "A payment made in order to borrow money. It means a business pays back more than it borrows."
}, {
	"word": "Shareholder",
	"def": "A person or organisation that owns part of a company."
}, {
	"word": "Asset",
	"def": "Something that is owned by a business. EG Machinery or buildings"
}, {
	"word": "Trade Credit",
	"def": "A period of time which suppliers allow customers before payment for supplies must be made."
}, {
	"word": "External Source of Finance",
	"def": "Refers to money that comes from outside the business. EG A loan from a bank."
}, {
	"word": "Collateral",
	"def": "An asset that a bank holds as security for the repayment of a loan"
}, {
	"word": "Mortgages",
	"def": "Loads from banks and build societies that are used to buy land and buildings."
}, {
	"word": "Building Societies",
	"def": "Organisations that offer a range of financial services. Mostly they provide savings accounts and mortgages."
}, {
	"word": "Overdraft",
	"def": "A flexible loan which businesses can use up to a agreed limit"
},{
	"word": "Cash Flow",
	"def": "The money that flows into and out of a business on a day-to-day basis"
}, {
	"word": "Cash Flow Forecast",
	"def": "A plan of the expected inflows and outflows to and from a business over a period of time"
}, {
	"word": "Cash Flow Statement",
	"def": "A record of the cash inflows and outflows tat took place over an earlier period of time"
}, {
	"word": "Profit",
	"def": "Measures the difference between the values of a business revenue and its total costs"
}, {
	"word": "Revenue",
	"def": "The income that a firm receives from selling its goods or servicces. It is also referred to as turnover."
}, {
	"word": "Sales",
	"def": "The number of products sold by a business"
}, {
	"word": "Costs",
	"def": "The spending that is necessary to set up and run a business"
}, {
	"word": "Fixed Costs",
	"def": "Costs that do not hange when a business changes its output"
}, {
	"word": "Variable Costs",
	"def": "Costs that vary directly with the business level of output"
}, {
	"word": "Total Cost",
	"def": "This is the total of fixed costs plus variable costs"
}, {
	"word": "Profit",
	"def": "Measures the difference between the values of a business revenue and its total costs"
}, {
	"word": "Loss",
	"def": "The amount by which a business costs are larger than its revenue"
}, {
	"word": "Investment",
	"def": "This takes place when a business buys an asset. EG A factory or training for staff."
}, {
	"word": "Average Rate of Return",
	"def": "This compares the average yearly profit from an investment with the cost of the investment and is stated as a percentage"
}, {
	"word": "Break Even",
	"def": "The level of production at which a businesses total costs and revenue from sales are equal"
}, {
	"word": "Break Even Chart",
	"def": "This shows a business cost and revenues and the level of product needed to break even."
}, {
	"word": "Margin of Safety",
	"def": "Measures the amount by which the current level of production exceeds its break-even level of output."
}, {
	"word": "Income Statement",
	"def": "A financial statement showing a businesses revenues and costs."
}, {
	"word": "Balance Sheet",
	"def": "This sets out the assets and liabilities that a business has on a particular day"
}, {
	"word": "Gross Profit",
	"def": "The sales revenue inus its costs of sales over a period of time - normally a year"
}, {
	"word": "Net Profit",
	"def": "This is the sales revenue of a business minus all costs over a period of time - normally a year"
}, {
	"word": "Liability",
	"def": "A sum of money that is owed by a business to another business or individual"
}, {
	"word": "Financial Ratio",
	"def": "This compares two figures from the businesses financial statements."
}, {
	"word": "Stakeholders",
	"def": "Individuals and organisations that are affected by and affect the business"
}]