[{"word":"Operating System","def":"Allows the user to manage the system and files."},{"word":"Kernel","def":"The interface between hardware and software (so programs can talk to the physical computer parts and vice versa)"},{"word":"User Interface","def":"How people see and use the Operating System. Could be GUI (like a tablet/smartphone/Windows) or Command Line Interface (CLI) where everything has to be typed in."},{"word":"Memory Management","def":"Manages RAM to make sure any unused portions are freed up for other programs."},{"word":"Multitasking","def":"Multiple instructions can be done at once and each process is given a share of time running on the CPU."},{"word":"Peripheral Management","def":"Manages the additional hardware of the computer mouse/keyboard/webcam/etc"},{"word":"Drivers","def":"Software that controls how the peripherals work in the computer"},{"word":"User Management","def":"Allows you to have different levels of user on the system each with their own access rights."},{"word":"File Management","def":"Allows you to create/copy/paste/cut/delete/edit files and create folders."},{"word":"Encryption","def":"Files and folders are jumbled up and only decrypted with an encryption “key”."},{"word":"Defragmentation","def":"Data often gets separated on disk. The defragmenter puts all the bits together and organises all the free space together. This speeds up file access."},{"word":"Lossy","def":"This data compression method removes data from files to make them take up less storage capacity and will load or transfer quicker. This gives the greatest reduction of file size."},{"word":"Lossless","def":"This data compression method uses algorithms to reduce the file size without destroying any data. This is useful for text files."},{"word":"Full Backup","def":"Backing up everything from a computer. Takes a long time to complete and lots of storage space. Quickest to recover from with the most options."},{"word":"Incremental Backup","def":"Backs up only the modified files (compared to the previous backup). Quickest to back up. Longest and most difficult to cover. Takes up the least space."}]