[{"word":"MAR","def":"Holds the position in memory of the next instruction"},
{"word":"MDR","def":"Holds the current data collected from memory"},
{"word":"PC","def":"Keeps track of the position in the current program"},
{"word":"ACC","def":"Stores the results of sums done by the ALU"},
{"word":"ALU","def":"Does the sums in the CPU"},
{"word":"CU","def":"Decides what to do with instructions"},
{"word":"Cache","def":"Stores the most recently used instructions and data"},
{"word":"FDE Cycle","def":"The order instructions that take place in the CPU"},
{"word":"Clock Speed","def":"The frequency of the processor."},
{"word":"Cache","def":"Very fast volatile memory as part of the CPU"},
{"word":"Cores","def":"More instructions per second as there are more groups of FDE cycles happening at once."},{"word":"Embedded System","def":"A system inside a device dedicated to that particular system"},
    {"word":"ROM","def":"Used to store the instructions to get the computer started. Non-volatile - Keeps information when it has no power."},
    {"word":"RAM","def":"Used for fast recovery of data and instructions. Volatile - Will lose the information when there is no power."},
    {"word":"Virtual Memory","def":"If you run out of RAM capacity the computer will start using secondary storage as __________ __________. This is very slow compared to RAM."},
    {"word":"Flash Memory","def":"Solid State Memory like memory sticks and SSDs."},{"word":"Primary Storage","def":"Cache and RAM - Volatile but fast for storing data and instructions about “running” programs."},{"word":"Secondary Storage","def":"Slower (than primary) but non-volatile and where data and instructions are stored when the device is powered off."},{"word":"Data Capacity","def":"The amount of storage space on a device"},{"word":"Optical","def":"Uses light to read and write to the media"},{"word":"Magnetic","def":"Uses magnetic charges to read and write."},{"word":"Solid State","def":"Like a hard drive but with chips instead of spinning metal disks"},{"word":"Capacity","def":"Amount of storage (Magnetic has the highest capacity)"},{"word":"Speed","def":"How fast data can be retrieved (Solid State is fastest)"},{"word":"Portability","def":"How easy it is to move between devices (Solid state is easiest)"},{"word":"Durability","def":"How well it can survive harsh conditions (Solid state is best)"},{"word":"Reliability","def":"How reliable is this storage method (Solid state)"},{"word":"Cost","def":"How expensive is it per MB of storage capacity (HDD is cheapest per MB)"},{"word":"LAN","def":"A network of computers within a small area (home or school networks)"},
{"word":"WAN","def":"A collection of LANs linked together - The internet!"},
{"word":"PAN","def":"Network using the “hotspot” feature from a phone"},
{"word":"Peer to peer","def":"A network where all computers are managed individually. (A home network)."},
{"word":"Client Server","def":"Like school where all computers are managed centrally you have to log on to get access to your drive. You can access your work from any computer on the network."},
{"word":"Wireless Access Points","def":"A device that allows Wifi access to a network (it transmits and receives Wifi signals)"},
{"word":"Routers","def":"This device allows data to be sent and received via a WAN."},
{"word":"NIC","def":"The component that allows you to connect to a network. This could be a Wifi card or have a socket that allows you to plug a network cable in."},{"word":"Transmission Media","def":"A fancy name for cable or wireless connection between devices."},
{"word":"DNS","def":"The internet telephone directory that links URLs to IP Addresses"},
{"word":"Hosting","def":"A host - a server that runs programs or stores files for other computers to access (May also host a website)"},
{"word":"The Cloud","def":"A server or collection of servers that host information or programs (iCloud is just a set of servers somewhere in the world with your data on them). ."},
{"word":"Virtual Networks","def":"A private network of computers connected on a larger network which is invisible to anyone not on that network."},{"word":"Star","def":"All devices on this network are singularly connected to the router"},{"word":"Mesh","def":"All devices are connected to each other creating a web of connections. A partial one of these has lots of routers that are connected."},{"word":"Wifi Frequency","def":"The signal in Hz that transmits the Wifi"},{"word":"Wifi Channels","def":"A wireless network has the option of using different ones of these so there is less likelyhood of interference."},{"word":"Encryption","def":"Jumbling up a message so someone listening in can’t understand it without the decryption key"},{"word":"Ethernet","def":"A group of devices that can share information"},{"word":"TCP/IP","def":"Guides WAN traffic to the correct destination"},{"word":"HTTP","def":"Sends webpage information"},{"word":"HTTPS","def":"Sends encrypted webpage information (usually to send sensitive information)"},{"word":"FTP","def":"A protocol that sends files"},{"word":"POP","def":"A protocol that collects and downloads email from servers (only useful if you only use one device to check your email)"},{"word":"IMAP","def":"A protocol that collects email and syncronises your email across multiple devices"},{"word":"SMTP","def":"A protocol that allows devices to send emails"},{"word":"Network Layers","def":"All network traffic is separated into different “layers” - each “layer” is independent and can be adjusted or deleted without effecting the rest."},{"word":"Packet Switching","def":"Files are split into packets of data. Each is sent separately and may take a different route to its destination."},{"word":"Malware","def":"Software designed to cause harm to your computer files"},{"word":"Phishing","def":"Fake messages that trick you to going to fake websites that then steal your password and username"},{"word":"Social Engineering","def":"Tricks that cause people to give out information or reduce security."},{"word":"Brute Force","def":"Guessing at lots of possible combinations to find a password"},{"word":"Denial of Service","def":"Sends lots of requests at the target server causing it to overload."},{"word":"Distributed Denial of Service","def":"When lots of different devices sent lots of requests at a target server with them aim of overloading it."},{"word":"Data Interception","def":"Packet sniffing software is used to catch data packets and piece them back together as they travel through the network."},{"word":"SQL Injection","def":"Adding SQL to input boxes on a website causing the website to reveal or delete data on the database."},{"word":"Poor Network Policy","def":"Not providing staff with enough guidance on how to use the network appropriately."},{"word":"Network Forensics","def":"Using software to track what network traffic is using the network and where it is going."},{"word":"Network Policy","def":"Rules of the network to make sure backup and updates take place - lock accounts after a number of incorrect guesses."},{"word":"Anti-Malware","def":"Software to detect and remove malware."},{"word":"Firewalls","def":"Software that prevents unauthorised connections in and out of the system."},{"word":"User Access Levels","def":"Allowing different user groups increasing levels of privilege (so in school pupils cannot run installers to install software or see the main computer drive)."},{"word":"Passwords","def":"Strong passwords using upper - lower - numbers - symbols"},{"word":"Encryption","def":"Network traffic should be ______________ to protect the data from anyone listening in."},{"word":"Operating System","def":"Allows the user to manage the system and files."},{"word":"Kernel","def":"The interface between hardware and software (so programs can talk to the physical computer parts and vice versa)"},{"word":"User Interface","def":"How people see and use the Operating System. Could be GUI (like a tablet/smartphone/Windows) or Command Line Interface (CLI) where everything has to be typed in."},{"word":"Memory Management","def":"Manages RAM to make sure any unused portions are freed up for other programs."},{"word":"Multitasking","def":"Multiple instructions can be done at once and each process is given a share of time running on the CPU."},{"word":"Peripheral Management","def":"Manages the additional hardware of the computer mouse/keyboard/webcam/etc"},{"word":"Drivers","def":"Software that controls how the peripherals work in the computer"},{"word":"User Management","def":"Allows you to have different levels of user on the system each with their own access rights."},{"word":"File Management","def":"Allows you to create/copy/paste/cut/delete/edit files and create folders."},{"word":"Encryption","def":"Files and folders are jumbled up and only decrypted with an encryption “key”."},{"word":"Defragmentation","def":"Data often gets separated on disk. The defragmenter puts all the bits together and organises all the free space together. This speeds up file access."},{"word":"Lossy","def":"This data compression method removes data from files to make them take up less storage capacity and will load or transfer quicker. This gives the greatest reduction of file size."},{"word":"Lossless","def":"This data compression method uses algorithms to reduce the file size without destroying any data. This is useful for text files."},{"word":"Full Backup","def":"Backing up everything from a computer. Takes a long time to complete and lots of storage space. Quickest to recover from with the most options."},{"word":"Incremental Backup","def":"Backs up only the modified files (compared to the previous backup). Quickest to back up. Longest and most difficult to cover. Takes up the least space."},{"word":"Open Source","def":"The source code to software is freely available. You can edit it however you wish but don’t expect any help fixing it if you break it. Usually created by a group of volunteers."},
{"word":"Proprietary","def":"A company or person holds the license to the software. Distributed as a finalised program that cannot be edited or changed. (To do so would break the law)."},
{"word":"Creative Commons","def":"A mix of proprietary and open source. Creators can share their creations with rules for selling/sharing and modifying work they created."},
{"word":"The Data Protection Act","def":"The law that requires anyone that collects information to keep it safe."},
{"word":"Computer Misuse Act","def":"The law making it illegal to “hack” or use a computer to commit a crime."},
{"word":"Copyright","def":"The law that protects ideas and creations from plagurism."},
{"word":"Freedom of Information Act","def":"A law that allows you to request to see the information businesses or people hold about you."},{"word":"Abstraction","def":"Filtering out parts of a problem that we don’t need to help simplify the solution."},{"word":"Decomposition","def":"Break the problem up into smaller easier to solve parts."},{"word":"Algorithmic Thinking","def":"Working out the order the solution should take"},{"word":"Binary Search","def":"A search algorithm that compares the center of a SORTED list with the target and then ignores the half without. This continues until it finds the target."},{"word":"Linear Search","def":"This method starts at the beginning of a list and looks at every item in turn until it finds the matching element."},{"word":"Bubble Sort","def":"Sorts a list by comparing and swapping values next to each other. Only stops when it detects that no swaps have taken place. This could take many passes to complete."},{"word":"Merge Sort","def":"The list is split up into lots of separate parts then each part is paired with another and sorted as it is combined."},{"word":"Insertion Sort","def":"The items in the list are checked (starting at the beginning) and put into the correct place in the list). This only takes one pass to complete."},{"word":"Sequence","def":"Code that is in a specific order"},{"word":"Selection","def":"IF Statements that branch code. (Also CASE or SWITCH statements)."},{"word":"Iteration","def":"FOR or WHILE or REPEAT or DO...UNTIL. Statements that cause the code to loop."},{"word":"Integer","def":"A whole number EG 7 (or negative)"},{"word":"Character","def":"A single character. EG $ - a C 2"},{"word":"String","def":"A group of characters"},{"word":"Boolean","def":"TRUE or FALSE"},{"word":"Casting","def":"Converting data from one type into another"},{"word":"+","def":"Add"},{"word":"-","def":"Subtract"},{"word":"*","def":"Multiply"},{"word":"/","def":"Divide"},{"word":"MOD","def":"Division that shows the remainder"},{"word":"DIV","def":"Division that shows the number of whole divisions"},{"word":"^","def":"Exponent"},{"word":"=","def":"Assign a value. name = “Chris”"},{"word":"==","def":"Check if two values match. If name == “Chris”:"},{"word":">","def":"Greater than"},{"word":">=","def":"Greater than or equal to"},{"word":"<","def":"Less than"},{"word":"<=","def":"Less than or equal to"},{"word":"!=","def":"Does not match / Is not equal to"},{"word":"Input Sanitation","def":"Checking any data entered by a user is valid and useful."},{"word":"Length Check","def":"Is the data the expected length?"},{"word":"Range Check","def":"Is the data within the expected range of values?"},{"word":"Presence Check","def":"Has anything been added?"},{"word":"Format Check","def":"Is the data in the appropriate format? (EG does it look like a postcode?)"},{"word":"Type Check","def":"Is it in the correct data type?"},{"word":"Contingency Planning","def":"What happens if they do enter something incorrectly?"},{"word":"Anticipating Misuse","def":"Planning so your system can deal with erroneous data being added and stop SQL injection attacks."},{"word":"Authentication","def":"Make the users log on to use the system"},{"word":"Comments","def":"Lines in the code used to report what the code does and how it works so someone else can continue to edit your code"},{"word":"Indentation","def":"Makes code more readable and shows the parts that belong together."},{"word":"Iterative Testing","def":"Testing as the program is created making gradual improvements."},{"word":"Final Testing","def":"Testing once the program is complete to check it meets the success criteria."},{"word":"Syntax Errors","def":"Errors that stop the code from running by not following the expected grammar of the programming language."},{"word":"Logic Errors","def":"Errors that do not stop the code from running but give unexpected results."},{"word":"Interpreter","def":"Converts a programming language into binary one line at a time. (Python or Javascript) - Stops when it finds an error."},{"word":"Translator","def":"Converts one programming language into another identifying errors as it does the translating."},{"word":"Compiler","def":"Converts all the code required for a program into binary and creates a .exe file. The .exe file will not work if there is an error."},{"word":"Assembler","def":"Takes low level assembler code and turns it into binary."},{"word":"Low Level Code","def":"Code closer to binary than to an easily understandable language. Assembler uses mnemonics or numbers to represent commands."},{"word":"High Level Code","def":"Code that is easier for a human to read. Like Python or Javascript"},{"word":"IDE","def":"Integrated Development Environment (Python’s IDLE or Microsoft Visual Code) Allows you to edit code (Editor) and provides tools like Syntax Highlighting and Error Diagnostics."},{"word":"Editor","def":"A tool that allows you to edit code."},{"word":"Syntax Highlighting","def":"Makes code key words different colours and highlights key punctuation."},{"word":"Error Diagnostics","def":"Gives clues to where there are errors in the code."},{"word":"Run Time Environment","def":"The tools needed to run the code."},{"word":"Binary Shift LEFT","def":"0110 -> 1100 This doubles the value for each shift (6 became 12). Two binary shifts would create 11000 = 24."},{"word":"Binary Shift RIGHT","def":"HALVES the value for each shift. 0110 -> 0011. 6 becomes 3 with one shift. Anything shifted below 1 is just ignored."}]