[
{"word":"ABDUCTION","def":"Movement away from the centre of the body"},
{"word":"ADDUCTION","def":"Movement towards the centre of the body"},
{"word":"AEROBIC RESPIRATION","def":"When the body releases energy using Glucose and Oxygen. Carbon Dioxide and Water are produced."},
{"word":"AGILITY","def":"The ability to change the position of the body quickly and with control"},
{"word":"ALVEOLI","def":"Small air bags in the lungs where gases are exchanged"},
{"word":"ANAEROBIC RESPIRATION","def":"When the body doesn’t have enough oxygen to release energy aerobically it will use glucose. Lactic Acid is produced."},{"word":"ANTAGONISTIC MUSCLE PAIR","def":"A pair of muscles that work together to bring about movement. Agonist contracts whilst Antagonist relaxes"},{"word":"AXIS","def":"An imaginary line that the body moves around: FRONTAL - SAGITTAL - VERTICAL"},
{"word":"BALANCE","def":"The ability to keep the body’s centre of mass over a base of support"},
{"word":"BALANCED DIET","def":"The best ratio of nutrients to match your lifestyle"},
{"word":"BASIC SKILL","def":"A simple skill that doesn’t need much concentration RUNNING"},
{"word":"BLOOD CELL","def":"A component of blood. RED – Carry Oxygen WHITE – Fight disease"},
{"word":"BLOOD PRESSURE","def":"How strongly the blood presses against the walls of the blood vessels"},
{"word":"BLOOD VESSEL","def":"Transport blood around the body ARTERIES - VEINS - CAPILLARIES"},
{"word":"BODY COMPOSITION","def":"The % of body weight made up by fat muscle and bone"},
{"word":"CARDIAC OUTPUT","def":"The volume of blood pumped out of the heard in one minute"},
{"word":"CARDIO-RESPIRATORY SYSTEM","def":"The Cardiovascular and Respiratory systems. They work together to get Oxygen into the body and Carbon Dioxide out"},{"word":"CARDIOVASCULAR FITNESS","def":"The ability of the heart and lungs to supply Oxygen to the muscles so that the whole body can exercise for a long time"},{"word":"CIRCUMDUCTION","def":"Movement of a body part in a circular motion"},
{"word":"CLOSED SKILL","def":"A skill performed in a predictable environment it is not affected by external factors"},
{"word":"COMMERCIALISATION","def":"The transformation of sport into something people can make money from"},
{"word":"COMPLEX SKILL","def":"A skill that needs a lot of concentration"},
{"word":"CONNECTIVE TISSUE","def":"Body tissue that holds parts of the body in place. Tendons - Ligaments - Cartilage"},
{"word":"COOL-DOWN","def":"Light exercise and stretching done after exercise to return the body to normal"},
{"word":"COORDINATION","def":"The ability to use two or more body parts together - efficiently and accurately"},
{"word":"CORONARY HEART DISEASE","def":"When fatty deposits build up in the arteries around the heart this restricts blood flow"},
{"word":"DEOXYGENATED BLOOD","def":"Blood that contains low levels of oxygen and high levels of carbon dioxide"},
{"word":"DEVIANCE","def":"Behaviour that goes against morals of the sport"},
{"word":"DIFFUSION","def":"When substances (O2) move from a place of high concentration to a place of low concentration"},
{"word":"DORSI-FLEXION","def":"Flexion of the ankle by lifting the toes"},
{"word":"EXERCISE","def":"A form of physical activity done to maintain and improve health and fitness"},
{"word":"EXTENSION","def":"Opening a joint"},
{"word":"FEEDBACK","def":"Information received about a performance CONCURRENT - TERMINAL - INTRINSIC - EXTRINSIC"},
{"word":"FITNESS","def":"The ability to meet the demands of the environment"},
{"word":"FLEXIBILITY","def":"The amount of movement possible at a joint"},
{"word":"FLEXION","def":"Closing a joint"},
{"word":"GAMESMANSHIP","def":"Gaining an advantage by using tactics that seem unfair but do not break the rules"},
{"word":"GUIDANCE","def":"Information or help in learning a skill VERBAL - VISUAL - MANUAL - MECHANICAL"},
{"word":"HEALTH","def":"A state of complete physical emotional and social well-being not merely the absence of disease of infirmity"},
{"word":"HEART RATE","def":"The number of times your heart beats in one minute BPM"},
{"word":"HIGH ORGANISATION SKILL","def":"A skill which cannot be broken down. Closely linked CARTWHEEL"},
{"word":"JOINT TYPE","def":"PIVOT - BALL & SOCKET - HINGE - CONDYLOID"},
{"word":"LACTIC ACID","def":"A waste product of anaerobic respiration which makes the muscles tired FATIGUE"},
{"word":"LOW ORGANISATION SKILL","def":"A skill that can be easily broken down into parts that can be practised separately. FRONT CRAWL"},
{"word":"MECHANICAL ADVANTAGE","def":"When a lever can move a large load with a small amount of effort"},
{"word":"MEDIA","def":"Organisations involved in mass communication TV - RADIO - NEWSPAPERS - INTERNET"},
{"word":"MUSCLE FIBRE","def":"The fibres that make up the muscles FAST (iia and iix) SLOW (i)"},
{"word":"MUSCULAR ENDURANCE","def":"The ability to repeatedly use the voluntary muscles for a long time without getting tired"},
{"word":"MUSCULO-SKELETAL SYSTEM","def":"The muscles and skeleton working together to allow movement"},
{"word":"OBESITY","def":"Having a lot more body fat than you should"},
{"word":"OPEN SKILL","def":"A skill performed in a changing environment where a performer has to react and adapt to external factors"},
{"word":"OPTIMUM WEIGHT","def":"What you should weigh for good health or performance GENDER - HEIGHT - BONY STRUCTURE - MUSCLE GIRTH"},{"word":"OVERLOAD","def":"Working your body harder to increase levels of fitness"},
{"word":"OXYGENATED BLOOD","def":"Blood that contains high levels of Oxygen and low levels of Carbon dioxide"},
{"word":"PEP","def":"Personal Exercise Programme"},
{"word":"PERFORMANCE","def":"How well a task is completed"},
{"word":"PLANE OF MOVEMENT","def":"An imaginary flat surface used to describe the direction of movement SAGITTAL - FRONTAL - TRANSVERSE"},
{"word":"PLANTAR-FLEXION","def":"Extension of the ankle joint by pointing the toes"},{"word":"POWER","def":"A combination of speed x strength"},{"word":"PRACTICE","def":"When a skill is repeated to improve it MASSED - DISTRIBUTED - FIXED - VARIABLE"},
{"word":"REATION TIME","def":"The time taken to move in reaction to a stimulus"},
{"word":"RESPIRATORY SYSTEM","def":"The organs used for breathing"},
{"word":"ROTATION","def":"Movement of a body part in a clockwise or anti-clockwise direction"},
{"word":"SEDENTARY LIFESTYLE","def":"Where there is little or no exercise"},
{"word":"SMART","def":"Goal Setting principles: SPECIFIC - MEASURABLE - ACHIEVABLE - REALISTIC - TIME-BOUND"},
{"word":"SOCIO-ECONOMIC GROUP","def":"People groups based on their job - how much money they have or where they live"},
{"word":"SPEED","def":"The rate at which someone can move or cover a distance"},
{"word":"SPONSORSHIP","def":"When a company pays to associate themselves with a part of a sport. Done to make money"},
{"word":"SPORTSMANSHIP","def":"Being honest sticking to the rules and treating your opponent with respect"},
{"word":"STRENGTH","def":"The amount of force that a muscle can apply against a resistance"},
{"word":"STROKE VOLUME","def":"The volume of blood pumped out from the heart in one beat"},
{"word":"TIDAL VOLUME","def":"The amount of air that is breathed in or out in one breath"},
{"word":"TREND","def":"When a graph is generally going up or down"},
{"word":"VERTEBRAL COLUMN","def":"The bones that make up the spinal column CERVICAL - THORACIC - LUMBAR - SACRUM - COCCYC"},
{"word":"VITAL CAPACITY","def":"The most air you can breathe out after breathing in the largest volume of air"},
{"word":"WARM-UP","def":"Preparing your body for exercise. LIGHT EXERCISE - STRETCHING - PRACTICE ACTIONS"}
]